{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"bolt://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"12345678\"\n",
    "auth=(username, password)\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "node_id = \"Disease::DOID:184\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query1(driver, node_id):\n",
    "    query = \"\"\"\n",
    "        MATCH (n {id: $node_id})\n",
    "        OPTIONAL MATCH (n)-[r1]->(target)\n",
    "        WHERE r1.metaedge IN ['DlA', 'DaG']\n",
    "        OPTIONAL MATCH (source)-[r2]->(n)\n",
    "        WHERE r2.metaedge IN ['CpD', 'CtD']\n",
    "        RETURN n, COLLECT(DISTINCT target) AS target_nodes, COLLECT(DISTINCT source) AS source_nodes\n",
    "    \"\"\"\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, node_id=node_id)\n",
    "        return result.data()  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'kind': 'Disease', 'name': 'bone cancer', 'id': 'Disease::DOID:184'},\n",
       "  'target_nodes': [{'kind': 'Anatomy',\n",
       "    'name': 'nose',\n",
       "    'id': 'Anatomy::UBERON:0000004'},\n",
       "   {'kind': 'Anatomy', 'name': 'appendage', 'id': 'Anatomy::UBERON:0000026'},\n",
       "   {'kind': 'Anatomy', 'name': 'tendon', 'id': 'Anatomy::UBERON:0000043'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'cranial nerve II',\n",
       "    'id': 'Anatomy::UBERON:0000941'},\n",
       "   {'kind': 'Anatomy', 'name': 'sternum', 'id': 'Anatomy::UBERON:0000975'},\n",
       "   {'kind': 'Anatomy', 'name': 'leg', 'id': 'Anatomy::UBERON:0000978'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'vertebral arch joint',\n",
       "    'id': 'Anatomy::UBERON:0001067'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'external carotid artery',\n",
       "    'id': 'Anatomy::UBERON:0001070'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'vertebral bone 2',\n",
       "    'id': 'Anatomy::UBERON:0001093'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'clavicle bone',\n",
       "    'id': 'Anatomy::UBERON:0001105'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'vertebral column',\n",
       "    'id': 'Anatomy::UBERON:0001130'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'external acoustic meatus',\n",
       "    'id': 'Anatomy::UBERON:0001352'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'sacro-iliac joint',\n",
       "    'id': 'Anatomy::UBERON:0001365'},\n",
       "   {'kind': 'Anatomy', 'name': 'epiphysis', 'id': 'Anatomy::UBERON:0001437'},\n",
       "   {'kind': 'Anatomy', 'name': 'face', 'id': 'Anatomy::UBERON:0001456'},\n",
       "   {'kind': 'Anatomy', 'name': 'arm', 'id': 'Anatomy::UBERON:0001460'},\n",
       "   {'kind': 'Anatomy', 'name': 'elbow', 'id': 'Anatomy::UBERON:0001461'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'manual digit 1',\n",
       "    'id': 'Anatomy::UBERON:0001463'},\n",
       "   {'kind': 'Anatomy', 'name': 'hip', 'id': 'Anatomy::UBERON:0001464'},\n",
       "   {'kind': 'Anatomy', 'name': 'knee', 'id': 'Anatomy::UBERON:0001465'},\n",
       "   {'kind': 'Anatomy', 'name': 'shoulder', 'id': 'Anatomy::UBERON:0001467'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'sternoclavicular joint',\n",
       "    'id': 'Anatomy::UBERON:0001469'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'glenohumeral joint',\n",
       "    'id': 'Anatomy::UBERON:0001470'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'sesamoid bone',\n",
       "    'id': 'Anatomy::UBERON:0001479'},\n",
       "   {'kind': 'Anatomy', 'name': 'knee joint', 'id': 'Anatomy::UBERON:0001485'},\n",
       "   {'kind': 'Anatomy', 'name': 'hip joint', 'id': 'Anatomy::UBERON:0001486'},\n",
       "   {'kind': 'Anatomy', 'name': 'ankle joint', 'id': 'Anatomy::UBERON:0001488'},\n",
       "   {'kind': 'Anatomy', 'name': 'elbow joint', 'id': 'Anatomy::UBERON:0001490'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'vertebral artery',\n",
       "    'id': 'Anatomy::UBERON:0001535'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'popliteal vein',\n",
       "    'id': 'Anatomy::UBERON:0001544'},\n",
       "   {'kind': 'Anatomy', 'name': 'cheek', 'id': 'Anatomy::UBERON:0001567'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'olfactory nerve',\n",
       "    'id': 'Anatomy::UBERON:0001579'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'masseter muscle',\n",
       "    'id': 'Anatomy::UBERON:0001597'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'temporalis muscle',\n",
       "    'id': 'Anatomy::UBERON:0001598'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'maxillary artery',\n",
       "    'id': 'Anatomy::UBERON:0001616'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'ophthalmic artery',\n",
       "    'id': 'Anatomy::UBERON:0001619'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'trigeminal nerve',\n",
       "    'id': 'Anatomy::UBERON:0001645'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'abducens nerve',\n",
       "    'id': 'Anatomy::UBERON:0001646'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'facial nerve',\n",
       "    'id': 'Anatomy::UBERON:0001647'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'hypoglossal nerve',\n",
       "    'id': 'Anatomy::UBERON:0001650'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'occipital bone',\n",
       "    'id': 'Anatomy::UBERON:0001676'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'sphenoid bone',\n",
       "    'id': 'Anatomy::UBERON:0001677'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'temporal bone',\n",
       "    'id': 'Anatomy::UBERON:0001678'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'ethmoid bone',\n",
       "    'id': 'Anatomy::UBERON:0001679'},\n",
       "   {'kind': 'Anatomy', 'name': 'nasal bone', 'id': 'Anatomy::UBERON:0001681'},\n",
       "   {'kind': 'Anatomy', 'name': 'mandible', 'id': 'Anatomy::UBERON:0001684'},\n",
       "   {'kind': 'Anatomy', 'name': 'hyoid bone', 'id': 'Anatomy::UBERON:0001685'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'external ear',\n",
       "    'id': 'Anatomy::UBERON:0001691'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'petrous part of temporal bone',\n",
       "    'id': 'Anatomy::UBERON:0001694'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'orbit of skull',\n",
       "    'id': 'Anatomy::UBERON:0001697'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'nasal cavity',\n",
       "    'id': 'Anatomy::UBERON:0001707'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'jaw skeleton',\n",
       "    'id': 'Anatomy::UBERON:0001708'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'lower jaw region',\n",
       "    'id': 'Anatomy::UBERON:0001710'},\n",
       "   {'kind': 'Anatomy', 'name': 'eyelid', 'id': 'Anatomy::UBERON:0001711'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'secondary palate',\n",
       "    'id': 'Anatomy::UBERON:0001716'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'sphenoidal sinus',\n",
       "    'id': 'Anatomy::UBERON:0001724'},\n",
       "   {'kind': 'Anatomy', 'name': 'soft palate', 'id': 'Anatomy::UBERON:0001733'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'palatine uvula',\n",
       "    'id': 'Anatomy::UBERON:0001734'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'lacrimal apparatus',\n",
       "    'id': 'Anatomy::UBERON:0001750'},\n",
       "   {'kind': 'Anatomy', 'name': 'middle ear', 'id': 'Anatomy::UBERON:0001756'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'frontal sinus',\n",
       "    'id': 'Anatomy::UBERON:0001760'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'turbinate bone',\n",
       "    'id': 'Anatomy::UBERON:0001762'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'maxillary sinus',\n",
       "    'id': 'Anatomy::UBERON:0001764'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'cranial nerve',\n",
       "    'id': 'Anatomy::UBERON:0001785'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'lumbosacral nerve plexus',\n",
       "    'id': 'Anatomy::UBERON:0001815'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'paranasal sinus',\n",
       "    'id': 'Anatomy::UBERON:0001825'},\n",
       "   {'kind': 'Anatomy', 'name': 'forelimb', 'id': 'Anatomy::UBERON:0002102'},\n",
       "   {'kind': 'Anatomy', 'name': 'hindlimb', 'id': 'Anatomy::UBERON:0002103'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'musculoskeletal system',\n",
       "    'id': 'Anatomy::UBERON:0002204'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'manubrium of sternum',\n",
       "    'id': 'Anatomy::UBERON:0002205'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'endolymphatic sac',\n",
       "    'id': 'Anatomy::UBERON:0002223'},\n",
       "   {'kind': 'Anatomy', 'name': 'rib', 'id': 'Anatomy::UBERON:0002228'},\n",
       "   {'kind': 'Anatomy', 'name': 'spinal cord', 'id': 'Anatomy::UBERON:0002240'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'popliteal artery',\n",
       "    'id': 'Anatomy::UBERON:0002250'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'thoracic vertebra',\n",
       "    'id': 'Anatomy::UBERON:0002347'},\n",
       "   {'kind': 'Anatomy', 'name': 'dura mater', 'id': 'Anatomy::UBERON:0002363'},\n",
       "   {'kind': 'Anatomy', 'name': 'bone marrow', 'id': 'Anatomy::UBERON:0002371'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'rectus abdominis muscle',\n",
       "    'id': 'Anatomy::UBERON:0002382'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'connective tissue',\n",
       "    'id': 'Anatomy::UBERON:0002384'},\n",
       "   {'kind': 'Anatomy', 'name': 'pes', 'id': 'Anatomy::UBERON:0002387'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'manual digit',\n",
       "    'id': 'Anatomy::UBERON:0002389'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'nasolacrimal duct',\n",
       "    'id': 'Anatomy::UBERON:0002392'},\n",
       "   {'kind': 'Anatomy', 'name': 'maxilla', 'id': 'Anatomy::UBERON:0002397'},\n",
       "   {'kind': 'Anatomy', 'name': 'manus', 'id': 'Anatomy::UBERON:0002398'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'cervical vertebra',\n",
       "    'id': 'Anatomy::UBERON:0002413'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'lumbar vertebra',\n",
       "    'id': 'Anatomy::UBERON:0002414'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'cartilage tissue',\n",
       "    'id': 'Anatomy::UBERON:0002418'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'ethmoid sinus',\n",
       "    'id': 'Anatomy::UBERON:0002453'},\n",
       "   {'kind': 'Anatomy', 'name': 'bone tissue', 'id': 'Anatomy::UBERON:0002481'},\n",
       "   {'kind': 'Anatomy', 'name': 'acromion', 'id': 'Anatomy::UBERON:0002497'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'zygomatic arch',\n",
       "    'id': 'Anatomy::UBERON:0002500'},\n",
       "   {'kind': 'Anatomy', 'name': 'periosteum', 'id': 'Anatomy::UBERON:0002515'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'epiphyseal plate',\n",
       "    'id': 'Anatomy::UBERON:0002516'},\n",
       "   {'kind': 'Anatomy', 'name': 'basicranium', 'id': 'Anatomy::UBERON:0002517'},\n",
       "   {'kind': 'Anatomy', 'name': 'skull', 'id': 'Anatomy::UBERON:0003129'},\n",
       "   {'kind': 'Anatomy', 'name': 'hard palate', 'id': 'Anatomy::UBERON:0003216'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'cranial suture',\n",
       "    'id': 'Anatomy::UBERON:0003685'},\n",
       "   {'kind': 'Anatomy', 'name': 'skeleton', 'id': 'Anatomy::UBERON:0004288'},\n",
       "   {'kind': 'Anatomy',\n",
       "    'name': 'carpal region',\n",
       "    'id': 'Anatomy::UBERON:0004452'},\n",
       "   {'kind': 'Anatomy', 'name': 'diaphysis', 'id': 'Anatomy::UBERON:0004769'},\n",
       "   {'kind': 'Anatomy', 'name': 'scapula', 'id': 'Anatomy::UBERON:0006849'},\n",
       "   {'kind': 'Gene', 'name': 'CDK4', 'id': 'Gene::1019'},\n",
       "   {'kind': 'Gene', 'name': 'TOPORS', 'id': 'Gene::10210'},\n",
       "   {'kind': 'Gene', 'name': 'CITED2', 'id': 'Gene::10370'},\n",
       "   {'kind': 'Gene', 'name': 'TUBB4B', 'id': 'Gene::10383'},\n",
       "   {'kind': 'Gene', 'name': 'EMILIN1', 'id': 'Gene::11117'},\n",
       "   {'kind': 'Gene', 'name': 'CHEK2', 'id': 'Gene::11200'},\n",
       "   {'kind': 'Gene', 'name': 'CYP3A4', 'id': 'Gene::1576'},\n",
       "   {'kind': 'Gene', 'name': 'DHFR', 'id': 'Gene::1719'},\n",
       "   {'kind': 'Gene', 'name': 'EGFR', 'id': 'Gene::1956'},\n",
       "   {'kind': 'Gene', 'name': 'EIF2S1', 'id': 'Gene::1965'},\n",
       "   {'kind': 'Gene', 'name': 'ENO2', 'id': 'Gene::2026'},\n",
       "   {'kind': 'Gene', 'name': 'ERG', 'id': 'Gene::2078'},\n",
       "   {'kind': 'Gene', 'name': 'ETV4', 'id': 'Gene::2118'},\n",
       "   {'kind': 'Gene', 'name': 'EWSR1', 'id': 'Gene::2130'},\n",
       "   {'kind': 'Gene', 'name': 'EZH2', 'id': 'Gene::2146'},\n",
       "   {'kind': 'Gene', 'name': 'FLI1', 'id': 'Gene::2313'},\n",
       "   {'kind': 'Gene', 'name': 'FLII', 'id': 'Gene::2314'},\n",
       "   {'kind': 'Gene', 'name': 'OTP', 'id': 'Gene::23440'},\n",
       "   {'kind': 'Gene', 'name': 'FOLR1', 'id': 'Gene::2348'},\n",
       "   {'kind': 'Gene', 'name': 'FUS', 'id': 'Gene::2521'},\n",
       "   {'kind': 'Gene', 'name': 'CIZ1', 'id': 'Gene::25792'},\n",
       "   {'kind': 'Gene', 'name': 'GNA11', 'id': 'Gene::2767'},\n",
       "   {'kind': 'Gene', 'name': 'CYP4V2', 'id': 'Gene::285440'},\n",
       "   {'kind': 'Gene', 'name': 'GRM1', 'id': 'Gene::2911'},\n",
       "   {'kind': 'Gene', 'name': 'GRM4', 'id': 'Gene::2914'},\n",
       "   {'kind': 'Gene', 'name': 'GSTP1', 'id': 'Gene::2950'},\n",
       "   {'kind': 'Gene', 'name': 'IGF1R', 'id': 'Gene::3480'},\n",
       "   {'kind': 'Gene', 'name': 'IL3', 'id': 'Gene::3562'},\n",
       "   {'kind': 'Gene', 'name': 'JUN', 'id': 'Gene::3725'},\n",
       "   {'kind': 'Gene', 'name': 'KIT', 'id': 'Gene::3815'},\n",
       "   {'kind': 'Gene', 'name': 'KRT83', 'id': 'Gene::3889'},\n",
       "   {'kind': 'Gene', 'name': 'LOX', 'id': 'Gene::4015'},\n",
       "   {'kind': 'Gene', 'name': 'MDM2', 'id': 'Gene::4193'},\n",
       "   {'kind': 'Gene', 'name': 'MET', 'id': 'Gene::4233'},\n",
       "   {'kind': 'Gene', 'name': 'CD99', 'id': 'Gene::4267'},\n",
       "   {'kind': 'Gene', 'name': 'MMP2', 'id': 'Gene::4313'},\n",
       "   {'kind': 'Gene', 'name': 'MMP9', 'id': 'Gene::4318'},\n",
       "   {'kind': 'Gene', 'name': 'MST1R', 'id': 'Gene::4486'},\n",
       "   {'kind': 'Gene', 'name': 'ATF1', 'id': 'Gene::466'},\n",
       "   {'kind': 'Gene', 'name': 'NT5C3A', 'id': 'Gene::51251'},\n",
       "   {'kind': 'Gene', 'name': 'PLAU', 'id': 'Gene::5328'},\n",
       "   {'kind': 'Gene', 'name': 'PLOD2', 'id': 'Gene::5352'},\n",
       "   {'kind': 'Gene', 'name': 'FEV', 'id': 'Gene::54738'},\n",
       "   {'kind': 'Gene', 'name': 'BCOR', 'id': 'Gene::54880'},\n",
       "   {'kind': 'Gene', 'name': 'TMEM144', 'id': 'Gene::55314'},\n",
       "   {'kind': 'Gene', 'name': 'FOXRED1', 'id': 'Gene::55572'},\n",
       "   {'kind': 'Gene', 'name': 'NDUFA12', 'id': 'Gene::55967'},\n",
       "   {'kind': 'Gene', 'name': 'PTGS2', 'id': 'Gene::5743'},\n",
       "   {'kind': 'Gene', 'name': 'ZNF77', 'id': 'Gene::58492'},\n",
       "   {'kind': 'Gene', 'name': 'RB1', 'id': 'Gene::5925'},\n",
       "   {'kind': 'Gene', 'name': 'RFC1', 'id': 'Gene::5981'},\n",
       "   {'kind': 'Gene', 'name': 'RGS1', 'id': 'Gene::5996'},\n",
       "   {'kind': 'Gene', 'name': 'BMI1', 'id': 'Gene::648'},\n",
       "   {'kind': 'Gene', 'name': 'SMO', 'id': 'Gene::6608'},\n",
       "   {'kind': 'Gene', 'name': 'SPARC', 'id': 'Gene::6678'},\n",
       "   {'kind': 'Gene', 'name': 'BRAF', 'id': 'Gene::673'},\n",
       "   {'kind': 'Gene', 'name': 'BRCA2', 'id': 'Gene::675'},\n",
       "   {'kind': 'Gene', 'name': 'SSX1', 'id': 'Gene::6756'},\n",
       "   {'kind': 'Gene', 'name': 'T', 'id': 'Gene::6862'},\n",
       "   {'kind': 'Gene', 'name': 'TGFBR2', 'id': 'Gene::7048'},\n",
       "   {'kind': 'Gene', 'name': 'TP53', 'id': 'Gene::7157'},\n",
       "   {'kind': 'Gene', 'name': 'PHLDA2', 'id': 'Gene::7262'},\n",
       "   {'kind': 'Gene', 'name': 'TUBB2A', 'id': 'Gene::7280'},\n",
       "   {'kind': 'Gene', 'name': 'WT1', 'id': 'Gene::7490'},\n",
       "   {'kind': 'Gene', 'name': 'MOGS', 'id': 'Gene::7841'},\n",
       "   {'kind': 'Gene', 'name': 'ST7', 'id': 'Gene::7982'},\n",
       "   {'kind': 'Gene', 'name': 'TAF15', 'id': 'Gene::8148'},\n",
       "   {'kind': 'Gene', 'name': 'C21orf33', 'id': 'Gene::8209'},\n",
       "   {'kind': 'Gene', 'name': 'LZIC', 'id': 'Gene::84328'},\n",
       "   {'kind': 'Gene', 'name': 'COPS3', 'id': 'Gene::8533'},\n",
       "   {'kind': 'Gene', 'name': 'CCNB3', 'id': 'Gene::85417'},\n",
       "   {'kind': 'Gene', 'name': 'TNFRSF11A', 'id': 'Gene::8792'},\n",
       "   {'kind': 'Gene', 'name': 'NR1I2', 'id': 'Gene::8856'},\n",
       "   {'kind': 'Gene', 'name': 'ZW10', 'id': 'Gene::9183'}],\n",
       "  'source_nodes': [{'kind': 'Compound',\n",
       "    'name': 'Epirubicin',\n",
       "    'id': 'Compound::DB00445'},\n",
       "   {'kind': 'Compound', 'name': 'Cisplatin', 'id': 'Compound::DB00515'},\n",
       "   {'kind': 'Compound', 'name': 'Methotrexate', 'id': 'Compound::DB00563'},\n",
       "   {'kind': 'Compound', 'name': 'Carboplatin', 'id': 'Compound::DB00958'},\n",
       "   {'kind': 'Compound', 'name': 'Doxorubicin', 'id': 'Compound::DB00997'}]}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = query1(driver, node_id)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Disease Name',\n",
       " 'bone cancer',\n",
       " 'Anatomy and Genes',\n",
       " 'nose',\n",
       " 'appendage',\n",
       " 'tendon',\n",
       " 'cranial nerve II',\n",
       " 'sternum',\n",
       " 'leg',\n",
       " 'vertebral arch joint',\n",
       " 'external carotid artery',\n",
       " 'vertebral bone 2',\n",
       " 'clavicle bone',\n",
       " 'vertebral column',\n",
       " 'external acoustic meatus',\n",
       " 'sacro-iliac joint',\n",
       " 'epiphysis',\n",
       " 'face',\n",
       " 'arm',\n",
       " 'elbow',\n",
       " 'manual digit 1',\n",
       " 'hip',\n",
       " 'knee',\n",
       " 'shoulder',\n",
       " 'sternoclavicular joint',\n",
       " 'glenohumeral joint',\n",
       " 'sesamoid bone',\n",
       " 'knee joint',\n",
       " 'hip joint',\n",
       " 'ankle joint',\n",
       " 'elbow joint',\n",
       " 'vertebral artery',\n",
       " 'popliteal vein',\n",
       " 'cheek',\n",
       " 'olfactory nerve',\n",
       " 'masseter muscle',\n",
       " 'temporalis muscle',\n",
       " 'maxillary artery',\n",
       " 'ophthalmic artery',\n",
       " 'trigeminal nerve',\n",
       " 'abducens nerve',\n",
       " 'facial nerve',\n",
       " 'hypoglossal nerve',\n",
       " 'occipital bone',\n",
       " 'sphenoid bone',\n",
       " 'temporal bone',\n",
       " 'ethmoid bone',\n",
       " 'nasal bone',\n",
       " 'mandible',\n",
       " 'hyoid bone',\n",
       " 'external ear',\n",
       " 'petrous part of temporal bone',\n",
       " 'orbit of skull',\n",
       " 'nasal cavity',\n",
       " 'jaw skeleton',\n",
       " 'lower jaw region',\n",
       " 'eyelid',\n",
       " 'secondary palate',\n",
       " 'sphenoidal sinus',\n",
       " 'soft palate',\n",
       " 'palatine uvula',\n",
       " 'lacrimal apparatus',\n",
       " 'middle ear',\n",
       " 'frontal sinus',\n",
       " 'turbinate bone',\n",
       " 'maxillary sinus',\n",
       " 'cranial nerve',\n",
       " 'lumbosacral nerve plexus',\n",
       " 'paranasal sinus',\n",
       " 'forelimb',\n",
       " 'hindlimb',\n",
       " 'musculoskeletal system',\n",
       " 'manubrium of sternum',\n",
       " 'endolymphatic sac',\n",
       " 'rib',\n",
       " 'spinal cord',\n",
       " 'popliteal artery',\n",
       " 'thoracic vertebra',\n",
       " 'dura mater',\n",
       " 'bone marrow',\n",
       " 'rectus abdominis muscle',\n",
       " 'connective tissue',\n",
       " 'pes',\n",
       " 'manual digit',\n",
       " 'nasolacrimal duct',\n",
       " 'maxilla',\n",
       " 'manus',\n",
       " 'cervical vertebra',\n",
       " 'lumbar vertebra',\n",
       " 'cartilage tissue',\n",
       " 'ethmoid sinus',\n",
       " 'bone tissue',\n",
       " 'acromion',\n",
       " 'zygomatic arch',\n",
       " 'periosteum',\n",
       " 'epiphyseal plate',\n",
       " 'basicranium',\n",
       " 'skull',\n",
       " 'hard palate',\n",
       " 'cranial suture',\n",
       " 'skeleton',\n",
       " 'carpal region',\n",
       " 'diaphysis',\n",
       " 'scapula',\n",
       " 'CDK4',\n",
       " 'TOPORS',\n",
       " 'CITED2',\n",
       " 'TUBB4B',\n",
       " 'EMILIN1',\n",
       " 'CHEK2',\n",
       " 'CYP3A4',\n",
       " 'DHFR',\n",
       " 'EGFR',\n",
       " 'EIF2S1',\n",
       " 'ENO2',\n",
       " 'ERG',\n",
       " 'ETV4',\n",
       " 'EWSR1',\n",
       " 'EZH2',\n",
       " 'FLI1',\n",
       " 'FLII',\n",
       " 'OTP',\n",
       " 'FOLR1',\n",
       " 'FUS',\n",
       " 'CIZ1',\n",
       " 'GNA11',\n",
       " 'CYP4V2',\n",
       " 'GRM1',\n",
       " 'GRM4',\n",
       " 'GSTP1',\n",
       " 'IGF1R',\n",
       " 'IL3',\n",
       " 'JUN',\n",
       " 'KIT',\n",
       " 'KRT83',\n",
       " 'LOX',\n",
       " 'MDM2',\n",
       " 'MET',\n",
       " 'CD99',\n",
       " 'MMP2',\n",
       " 'MMP9',\n",
       " 'MST1R',\n",
       " 'ATF1',\n",
       " 'NT5C3A',\n",
       " 'PLAU',\n",
       " 'PLOD2',\n",
       " 'FEV',\n",
       " 'BCOR',\n",
       " 'TMEM144',\n",
       " 'FOXRED1',\n",
       " 'NDUFA12',\n",
       " 'PTGS2',\n",
       " 'ZNF77',\n",
       " 'RB1',\n",
       " 'RFC1',\n",
       " 'RGS1',\n",
       " 'BMI1',\n",
       " 'SMO',\n",
       " 'SPARC',\n",
       " 'BRAF',\n",
       " 'BRCA2',\n",
       " 'SSX1',\n",
       " 'T',\n",
       " 'TGFBR2',\n",
       " 'TP53',\n",
       " 'PHLDA2',\n",
       " 'TUBB2A',\n",
       " 'WT1',\n",
       " 'MOGS',\n",
       " 'ST7',\n",
       " 'TAF15',\n",
       " 'C21orf33',\n",
       " 'LZIC',\n",
       " 'COPS3',\n",
       " 'CCNB3',\n",
       " 'TNFRSF11A',\n",
       " 'NR1I2',\n",
       " 'ZW10',\n",
       " 'Compounds',\n",
       " 'Epirubicin',\n",
       " 'Cisplatin',\n",
       " 'Methotrexate',\n",
       " 'Carboplatin',\n",
       " 'Doxorubicin']"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "names = []\n",
    "\n",
    "disease_name = result[0]['n']['name']\n",
    "names.append('Disease Name')\n",
    "names.append(disease_name)\n",
    "\n",
    "names.append('Anatomy and Genes')\n",
    "for node in result[0]['target_nodes']:\n",
    "    names.append(node['name'])\n",
    "\n",
    "names.append('Compounds')\n",
    "for node in result[0]['source_nodes']:\n",
    "    names.append(node['name'])\n",
    "\n",
    "names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def query2(driver):\n",
    "    query = \"\"\"\n",
    "    MATCH (disease)\n",
    "    WHERE disease.kind = 'Disease'\n",
    "    AND NOT EXISTS {\n",
    "        MATCH (disease)-[]-(compound)\n",
    "        WHERE compound.kind = 'Compound'\n",
    "    }\n",
    "    WITH COLLECT(disease) AS diseases\n",
    "    MATCH (disease)-[disAnatRel]->(anatomy)\n",
    "    WHERE disease IN diseases\n",
    "      AND disAnatRel.metaedge = 'DlA' \n",
    "      AND anatomy.kind = 'Anatomy'\n",
    "    WITH COLLECT(DISTINCT anatomy) AS anatomies\n",
    "    MATCH (compound)-[compoundGeneRel]->(gene)<-[anatomyGeneRel]-(anatomy)\n",
    "    WHERE compound.kind = 'Compound'\n",
    "      AND gene.kind = 'Gene'\n",
    "      AND anatomy IN anatomies\n",
    "      AND (\n",
    "          (compoundGeneRel.metaedge = 'CuG' AND anatomyGeneRel.metaedge = 'AdG')\n",
    "          OR\n",
    "          (compoundGeneRel.metaedge = 'CdG' AND anatomyGeneRel.metaedge = 'AuG')\n",
    "      )\n",
    "    \n",
    "    RETURN DISTINCT compound\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        return list(result.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "compounds = query2(driver)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "783"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(compounds)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Quinacrine',\n",
       " 'Topotecan',\n",
       " 'Mitoxantrone',\n",
       " 'Vorinostat',\n",
       " 'Lovastatin',\n",
       " 'Mitomycin',\n",
       " 'Vindesine',\n",
       " 'Vinorelbine',\n",
       " 'Treprostinil',\n",
       " 'Amlodipine',\n",
       " 'Alprazolam',\n",
       " 'Teniposide',\n",
       " 'Chlorpromazine',\n",
       " 'Raloxifene',\n",
       " 'Triflupromazine',\n",
       " 'Albendazole',\n",
       " 'Toremifene',\n",
       " 'Vincristine',\n",
       " 'Vinblastine',\n",
       " 'Nizatidine',\n",
       " 'Astemizole',\n",
       " 'Simvastatin',\n",
       " 'Mebendazole',\n",
       " 'Tamoxifen',\n",
       " 'Trimipramine',\n",
       " 'Irinotecan',\n",
       " 'Perphenazine',\n",
       " 'Clomifene',\n",
       " 'Maprotiline',\n",
       " 'Cerulenin',\n",
       " 'Perhexiline',\n",
       " 'Fluvastatin',\n",
       " 'Pimozide',\n",
       " 'Sertraline',\n",
       " 'Amiodarone',\n",
       " 'Podofilox',\n",
       " 'Ciclopirox',\n",
       " 'Clarithromycin',\n",
       " 'Paclitaxel',\n",
       " 'Chlorprothixene',\n",
       " 'Alimemazine',\n",
       " 'Docetaxel',\n",
       " 'Colchicine',\n",
       " 'Everolimus',\n",
       " 'Thiothixene',\n",
       " 'Niclosamide',\n",
       " 'Crizotinib',\n",
       " 'Dabrafenib',\n",
       " 'Afatinib',\n",
       " 'Flubendazole',\n",
       " 'Azithromycin',\n",
       " 'Cefotiam',\n",
       " 'Cefalotin',\n",
       " 'Entacapone',\n",
       " 'Ciprofloxacin',\n",
       " 'Metaxalone',\n",
       " 'Minaprine',\n",
       " 'Fulvestrant',\n",
       " 'Nefazodone',\n",
       " 'Estriol',\n",
       " 'Temsirolimus',\n",
       " 'Cyclosporine',\n",
       " 'Pyrimethamine',\n",
       " 'Reserpine',\n",
       " 'Nitazoxanide',\n",
       " 'Methotrexate',\n",
       " 'Ivermectin',\n",
       " 'Clofarabine',\n",
       " 'Sirolimus',\n",
       " 'Methyldopa',\n",
       " 'Busulfan',\n",
       " 'Rosuvastatin',\n",
       " 'Bupropion',\n",
       " 'Dasatinib',\n",
       " 'Bosutinib',\n",
       " 'Triclosan',\n",
       " 'Pitavastatin',\n",
       " 'Ruxolitinib',\n",
       " 'Vemurafenib',\n",
       " 'Trametinib',\n",
       " 'Epirubicin',\n",
       " 'Thioridazine',\n",
       " 'Daunorubicin',\n",
       " 'Paroxetine',\n",
       " 'Doxorubicin',\n",
       " 'Idarubicin',\n",
       " 'Varenicline',\n",
       " 'Estradiol',\n",
       " 'Betamethasone',\n",
       " 'Dexamethasone',\n",
       " 'Cladribine',\n",
       " 'Floxuridine',\n",
       " 'Levonorgestrel',\n",
       " 'Gemcitabine',\n",
       " 'Mycophenolate mofetil',\n",
       " 'Etoposide',\n",
       " 'Cytarabine',\n",
       " 'Mycophenolic acid',\n",
       " 'Danazol',\n",
       " 'Sorafenib',\n",
       " 'Menadione',\n",
       " 'Oxiconazole',\n",
       " 'Penicillin V',\n",
       " 'Erlotinib',\n",
       " 'Donepezil',\n",
       " 'Levorphanol',\n",
       " 'Terbinafine',\n",
       " 'Ethacrynic acid',\n",
       " 'Dactinomycin',\n",
       " 'Bisacodyl',\n",
       " 'Famciclovir',\n",
       " 'Cyproheptadine',\n",
       " 'Procaine',\n",
       " 'Thiabendazole',\n",
       " 'Tranylcypromine',\n",
       " 'Sulfadoxine',\n",
       " 'Stanozolol',\n",
       " 'Bortezomib',\n",
       " 'Reboxetine',\n",
       " 'Rosiglitazone',\n",
       " 'Clonidine',\n",
       " 'Pindolol',\n",
       " 'Metrizamide',\n",
       " 'Diflorasone',\n",
       " 'Tacrolimus',\n",
       " 'Nonoxynol-9',\n",
       " 'Liothyronine',\n",
       " 'Nitrofural',\n",
       " 'Phensuximide',\n",
       " 'Vardenafil',\n",
       " 'Dienestrol',\n",
       " 'Mesoridazine',\n",
       " 'Methylprednisolone',\n",
       " 'Azelastine',\n",
       " 'Glyburide',\n",
       " 'Gatifloxacin',\n",
       " 'Etidronic acid',\n",
       " 'Terazosin',\n",
       " 'Anastrozole',\n",
       " 'Liotrix',\n",
       " 'Pentamidine',\n",
       " 'Exemestane',\n",
       " 'Homoharringtonine',\n",
       " 'Methylergometrine',\n",
       " 'Cefotaxime',\n",
       " 'Alitretinoin',\n",
       " 'Norethindrone',\n",
       " 'Tretinoin',\n",
       " 'Ethynodiol',\n",
       " 'Bromfenac',\n",
       " 'Isotretinoin',\n",
       " 'Captopril',\n",
       " 'Procaterol',\n",
       " 'Testosterone Propionate',\n",
       " 'Roxatidine acetate',\n",
       " 'Amodiaquine',\n",
       " 'Digoxin',\n",
       " 'Ouabain',\n",
       " 'Digitoxin',\n",
       " 'Ponatinib',\n",
       " 'Vidarabine',\n",
       " 'Mesalazine',\n",
       " 'Medrysone',\n",
       " 'Chlorambucil',\n",
       " 'Raltitrexed',\n",
       " 'Gefitinib',\n",
       " 'Mirtazapine',\n",
       " 'Nisoldipine',\n",
       " 'Trifluridine',\n",
       " 'Bendroflumethiazide',\n",
       " 'Monobenzone',\n",
       " 'Adenosine',\n",
       " 'Disulfiram',\n",
       " 'Mifepristone',\n",
       " 'Phenoxybenzamine',\n",
       " 'Azacitidine',\n",
       " 'Nifedipine',\n",
       " 'Prednicarbate',\n",
       " 'Chloroxine',\n",
       " 'Sunitinib',\n",
       " 'Calcipotriol',\n",
       " 'Cyproterone acetate',\n",
       " 'Nilotinib',\n",
       " 'Acetylcysteine',\n",
       " 'Flunisolide',\n",
       " 'Amcinonide',\n",
       " 'Fluorometholone',\n",
       " 'Desoximetasone',\n",
       " 'Fluticasone Propionate',\n",
       " 'Triamcinolone',\n",
       " 'Hydrocortisone',\n",
       " 'Flurandrenolide',\n",
       " 'Dirithromycin',\n",
       " 'Clobetasol propionate',\n",
       " 'Thalidomide',\n",
       " 'Fluocinonide',\n",
       " 'Gliclazide',\n",
       " 'Dexfenfluramine',\n",
       " 'Budesonide',\n",
       " 'Sulfadimethoxine',\n",
       " 'Iopanoic acid',\n",
       " 'Loperamide',\n",
       " 'Pravastatin',\n",
       " 'Lansoprazole',\n",
       " 'Etoricoxib',\n",
       " 'Diazoxide',\n",
       " 'Metoprolol',\n",
       " 'Pentobarbital',\n",
       " 'Cyclophosphamide',\n",
       " 'Medroxyprogesterone Acetate',\n",
       " 'Aciclovir',\n",
       " 'Alprenolol',\n",
       " 'Hydrochlorothiazide',\n",
       " 'Sertindole',\n",
       " 'Methyltestosterone',\n",
       " 'Dihomo-gamma-linolenic acid',\n",
       " 'Vitamin A',\n",
       " 'Carbidopa',\n",
       " 'Indinavir',\n",
       " 'Clemastine',\n",
       " 'Metformin',\n",
       " 'Ipratropium bromide',\n",
       " 'Protriptyline',\n",
       " 'Ethopropazine',\n",
       " 'Triprolidine',\n",
       " 'Dipivefrin',\n",
       " 'Methoxsalen',\n",
       " 'Fluocinolone Acetonide',\n",
       " 'Cefixime',\n",
       " 'Naltrexone',\n",
       " 'Naproxen',\n",
       " 'Candesartan',\n",
       " 'Trifluoperazine',\n",
       " 'Isosorbide Dinitrate',\n",
       " 'Granisetron',\n",
       " 'Famotidine',\n",
       " 'Ethinyl Estradiol',\n",
       " 'Ketoprofen',\n",
       " 'Benzocaine',\n",
       " 'Sibutramine',\n",
       " 'Sulfinpyrazone',\n",
       " 'Orphenadrine',\n",
       " 'Quetiapine',\n",
       " 'Gemfibrozil',\n",
       " 'Methotrimeprazine',\n",
       " 'Phenazopyridine',\n",
       " 'Thioproperazine',\n",
       " 'Iobenguane',\n",
       " 'Clopidogrel',\n",
       " 'L-Glutamine',\n",
       " 'Alpha-Linolenic Acid',\n",
       " 'Vitamin E',\n",
       " 'Aminosalicylic Acid',\n",
       " 'Anagrelide',\n",
       " 'Tenofovir',\n",
       " 'Metixene',\n",
       " 'Cetirizine',\n",
       " 'Minoxidil',\n",
       " 'Spironolactone',\n",
       " 'Levothyroxine',\n",
       " 'Dextrothyroxine',\n",
       " 'Fluorouracil',\n",
       " 'Enalapril',\n",
       " 'Testosterone',\n",
       " 'Alendronate',\n",
       " 'Estrone',\n",
       " 'Warfarin',\n",
       " 'Tizanidine',\n",
       " 'Imiquimod',\n",
       " 'Meclizine',\n",
       " 'Zileuton',\n",
       " 'Carbinoxamine',\n",
       " 'Oxcarbazepine',\n",
       " 'Roxithromycin',\n",
       " 'Orciprenaline',\n",
       " 'Dorzolamide',\n",
       " 'Norgestimate',\n",
       " 'Dipyridamole',\n",
       " 'Gabapentin',\n",
       " 'Letrozole',\n",
       " 'Melatonin',\n",
       " 'Bretylium',\n",
       " 'Itraconazole',\n",
       " 'Flecainide',\n",
       " 'Iodixanol',\n",
       " 'Practolol',\n",
       " 'Rivaroxaban',\n",
       " 'Iopamidol',\n",
       " 'Hexetidine',\n",
       " 'Benzylpenicillin',\n",
       " 'Sulfathiazole',\n",
       " 'Doxapram',\n",
       " 'Phenelzine',\n",
       " 'Aminolevulinic acid',\n",
       " 'Flucytosine',\n",
       " 'Chlormezanone',\n",
       " 'Pazopanib',\n",
       " 'Biperiden',\n",
       " 'Ritodrine',\n",
       " 'Ropivacaine',\n",
       " 'Estradiol valerate/Dienogest',\n",
       " 'Propylthiouracil',\n",
       " 'Fluphenazine',\n",
       " 'Hexachlorophene',\n",
       " 'Cromoglicic acid',\n",
       " 'Melphalan',\n",
       " 'Isoprenaline',\n",
       " 'Atorvastatin',\n",
       " 'Suramin',\n",
       " 'Stavudine',\n",
       " 'Riluzole',\n",
       " 'Prednisolone',\n",
       " 'Kanamycin',\n",
       " 'Bezafibrate',\n",
       " 'Calcidiol',\n",
       " 'Torasemide',\n",
       " 'Clozapine',\n",
       " 'Carbimazole',\n",
       " 'Dicloxacillin',\n",
       " 'Tolnaftate',\n",
       " 'Nortriptyline',\n",
       " 'Cisapride',\n",
       " 'Mecamylamine',\n",
       " 'Lamivudine',\n",
       " 'Haloprogin',\n",
       " 'Gentamicin',\n",
       " 'Salmeterol',\n",
       " 'Mepivacaine',\n",
       " 'Rivastigmine',\n",
       " 'Azathioprine',\n",
       " 'Miconazole',\n",
       " 'Papaverine',\n",
       " 'Ifosfamide',\n",
       " 'Sparfloxacin',\n",
       " 'Isocarboxazid',\n",
       " 'Troleandomycin',\n",
       " 'Acenocoumarol',\n",
       " 'Tiaprofenic acid',\n",
       " 'Bacampicillin',\n",
       " 'Fluspirilene',\n",
       " 'Tamibarotene',\n",
       " 'Xylometazoline',\n",
       " 'Riboflavin',\n",
       " 'Beclomethasone',\n",
       " 'Enoxacin',\n",
       " 'Cinnarizine',\n",
       " 'Sulfamethizole',\n",
       " 'Diclofenac',\n",
       " 'Ribavirin',\n",
       " 'Phenylbutazone',\n",
       " 'Sulfapyridine',\n",
       " 'Emedastine',\n",
       " 'Cefuroxime',\n",
       " 'Cyclizine',\n",
       " 'Alizapride',\n",
       " 'Oxprenolol',\n",
       " 'Trioxsalen',\n",
       " 'Mepenzolate',\n",
       " 'Ropinirole',\n",
       " 'Flucloxacillin',\n",
       " 'Ampicillin',\n",
       " 'Ethionamide',\n",
       " 'Losartan',\n",
       " 'Auranofin',\n",
       " 'Esmolol',\n",
       " 'Cefmetazole',\n",
       " 'Trimethadione',\n",
       " 'Doxylamine',\n",
       " 'Suprofen',\n",
       " 'Didanosine',\n",
       " 'Spectinomycin',\n",
       " 'Levobunolol',\n",
       " 'Sildenafil',\n",
       " 'Ketotifen',\n",
       " 'Acitretin',\n",
       " 'Remoxipride',\n",
       " 'Lapatinib',\n",
       " 'Citalopram',\n",
       " 'Escitalopram',\n",
       " 'Pivmecillinam',\n",
       " 'Calcitriol',\n",
       " 'Darifenacin',\n",
       " 'Aminocaproic Acid',\n",
       " 'Azlocillin',\n",
       " 'Latamoxef',\n",
       " 'Benazepril',\n",
       " 'Fenoldopam',\n",
       " 'Misoprostol',\n",
       " 'Glipizide',\n",
       " 'Diclofenamide',\n",
       " 'Imipenem',\n",
       " 'Ibudilast',\n",
       " 'Topiramate',\n",
       " 'Sulpiride',\n",
       " 'Epinephrine',\n",
       " 'Ritonavir',\n",
       " 'Dextromethorphan',\n",
       " 'Cinalukast',\n",
       " 'Bacitracin',\n",
       " 'Mitotane',\n",
       " 'Verapamil',\n",
       " 'Diethylcarbamazine',\n",
       " 'Ethotoin',\n",
       " 'Nitrendipine',\n",
       " 'Cefadroxil',\n",
       " 'Cilostazol',\n",
       " 'Tubocurarine',\n",
       " 'Finasteride',\n",
       " 'Iohexol',\n",
       " 'Cefepime',\n",
       " 'Oxybenzone',\n",
       " 'Prednisone',\n",
       " 'Ceforanide',\n",
       " 'Neostigmine',\n",
       " 'Epirizole',\n",
       " 'Moricizine',\n",
       " 'Hydroflumethiazide',\n",
       " 'Altretamine',\n",
       " 'Naloxone',\n",
       " 'Isometheptene',\n",
       " 'Glucosamine',\n",
       " 'Betahistine',\n",
       " 'Chloramphenicol',\n",
       " 'Pyridostigmine',\n",
       " 'Theobromine',\n",
       " 'Etofenamate',\n",
       " 'Buspirone',\n",
       " 'Felodipine',\n",
       " 'Yohimbine',\n",
       " 'Atomoxetine',\n",
       " 'Modafinil',\n",
       " 'Adenosine monophosphate',\n",
       " 'Pirenzepine',\n",
       " 'Flurbiprofen',\n",
       " 'Oxybuprocaine',\n",
       " 'Tolbutamide',\n",
       " 'Proguanil',\n",
       " 'Equilin',\n",
       " 'Maraviroc',\n",
       " 'Idoxuridine',\n",
       " 'Tranexamic Acid',\n",
       " 'Zalcitabine',\n",
       " 'Chlorcyclizine',\n",
       " 'Cloperastine',\n",
       " 'Fenbufen',\n",
       " 'Sitagliptin',\n",
       " 'Adapalene',\n",
       " 'Nelfinavir',\n",
       " 'Balsalazide',\n",
       " 'Amitriptyline',\n",
       " 'Moclobemide',\n",
       " 'Fursultiamine',\n",
       " 'Chlorhexidine',\n",
       " 'Lenalidomide',\n",
       " 'Sumatriptan',\n",
       " 'Nicergoline',\n",
       " 'Probenecid',\n",
       " 'Levofloxacin',\n",
       " 'Ofloxacin',\n",
       " 'Ursodeoxycholic acid',\n",
       " 'Nitrazepam',\n",
       " 'Thiotepa',\n",
       " 'Chenodeoxycholic acid',\n",
       " 'Sulfacetamide',\n",
       " 'Eplerenone',\n",
       " 'Molindone',\n",
       " 'Bromocriptine',\n",
       " 'Decitabine',\n",
       " 'Erythromycin',\n",
       " 'Ketoconazole',\n",
       " 'Orlistat',\n",
       " 'Fenoterol',\n",
       " 'Nimodipine',\n",
       " 'Oxandrolone',\n",
       " 'Niacin',\n",
       " 'Tiagabine',\n",
       " 'Dinoprostone',\n",
       " 'Praziquantel',\n",
       " 'Leflunomide',\n",
       " 'Diphenylpyraline',\n",
       " 'Sulfamerazine',\n",
       " 'Tramadol',\n",
       " 'Rimonabant',\n",
       " 'Isradipine',\n",
       " 'Clenbuterol',\n",
       " 'Dofetilide',\n",
       " 'Carprofen',\n",
       " 'Ergonovine',\n",
       " 'Enzalutamide',\n",
       " 'Olanzapine',\n",
       " 'Alfuzosin',\n",
       " 'Flutamide',\n",
       " 'Etodolac',\n",
       " 'Trichlormethiazide',\n",
       " 'Flumazenil',\n",
       " 'Diphenidol',\n",
       " 'Metaraminol',\n",
       " 'L-DOPA',\n",
       " 'Cinchocaine',\n",
       " 'Ganciclovir',\n",
       " 'Diosmin',\n",
       " 'Ethosuximide',\n",
       " 'Saquinavir',\n",
       " 'Plerixafor',\n",
       " 'Carbachol',\n",
       " 'Sulfisoxazole',\n",
       " 'Dapsone',\n",
       " 'Phenylpropanolamine',\n",
       " 'Promazine',\n",
       " 'Ketorolac',\n",
       " 'Temozolomide',\n",
       " 'Meclofenamic acid',\n",
       " 'Nadolol',\n",
       " 'Alfacalcidol',\n",
       " 'Icosapent',\n",
       " 'Cephalexin',\n",
       " 'Fenofibrate',\n",
       " 'Mephentermine',\n",
       " 'Chlorothiazide',\n",
       " 'Dihydroergotamine',\n",
       " 'Propantheline',\n",
       " 'Proparacaine',\n",
       " 'Piperacillin',\n",
       " 'Imatinib',\n",
       " 'Pyrazinamide',\n",
       " 'Naftifine',\n",
       " 'Aripiprazole',\n",
       " 'Butoconazole',\n",
       " 'Nalbuphine',\n",
       " 'Etomidate',\n",
       " 'Diltiazem',\n",
       " 'Hyoscyamine',\n",
       " 'Atropine',\n",
       " 'Dextropropoxyphene',\n",
       " 'Methimazole',\n",
       " 'Pilocarpine',\n",
       " 'Procarbazine',\n",
       " 'Levetiracetam',\n",
       " 'Phentermine',\n",
       " 'Cabergoline',\n",
       " 'Rifapentine',\n",
       " 'Repaglinide',\n",
       " 'Domperidone',\n",
       " 'Biotin',\n",
       " 'Fluoxetine',\n",
       " 'Linezolid',\n",
       " 'Tolazamide',\n",
       " 'Rimexolone',\n",
       " 'Irbesartan',\n",
       " 'Econazole',\n",
       " 'Mefloquine',\n",
       " 'Pralidoxime',\n",
       " 'Novobiocin',\n",
       " 'Nabumetone',\n",
       " 'Pentoxifylline',\n",
       " 'Loxapine',\n",
       " 'Fluconazole',\n",
       " 'Theophylline',\n",
       " 'Formoterol',\n",
       " 'Arformoterol',\n",
       " 'Olopatadine',\n",
       " 'Quinine',\n",
       " 'Lisinopril',\n",
       " 'Quinidine',\n",
       " 'Amoxapine',\n",
       " 'Desipramine',\n",
       " 'Rescinnamine',\n",
       " 'Zuclopenthixol',\n",
       " 'Hexylcaine',\n",
       " 'Quinethazone',\n",
       " 'Indomethacin',\n",
       " 'Progesterone',\n",
       " 'Pseudoephedrine',\n",
       " 'Zonisamide',\n",
       " 'Ephedrine',\n",
       " 'Amifostine',\n",
       " 'Flunarizine',\n",
       " 'Dexmedetomidine',\n",
       " 'Diflunisal',\n",
       " 'Valsartan',\n",
       " 'Ezetimibe',\n",
       " 'Chlorphenamine',\n",
       " 'Nalidixic Acid',\n",
       " 'Celecoxib',\n",
       " 'Zidovudine',\n",
       " 'Tocainide',\n",
       " 'Primaquine',\n",
       " 'Lorazepam',\n",
       " 'Acetaminophen',\n",
       " 'Timolol',\n",
       " 'Triamterene',\n",
       " 'Cyclopentolate',\n",
       " 'Acepromazine',\n",
       " 'Isoxsuprine',\n",
       " 'Procyclidine',\n",
       " 'Conjugated Estrogens',\n",
       " 'Entecavir',\n",
       " 'Terbutaline',\n",
       " 'Probucol',\n",
       " 'Alverine',\n",
       " 'Estropipate',\n",
       " 'Ranitidine',\n",
       " 'Amoxicillin',\n",
       " 'Ranolazine',\n",
       " 'Perindopril',\n",
       " 'Cimetidine',\n",
       " 'Bumetanide',\n",
       " 'Carbamazepine',\n",
       " 'Dinoprost Tromethamine',\n",
       " 'Aminohippurate',\n",
       " 'Nicardipine',\n",
       " 'Paromomycin',\n",
       " 'Dacarbazine',\n",
       " 'Disopyramide',\n",
       " 'Omeprazole',\n",
       " 'Duloxetine',\n",
       " 'Esomeprazole',\n",
       " 'Memantine',\n",
       " 'Guanabenz',\n",
       " 'Moexipril',\n",
       " 'Oxybutynin',\n",
       " 'Streptozocin',\n",
       " 'Ondansetron',\n",
       " 'Methantheline',\n",
       " 'Hydroxychloroquine',\n",
       " 'Clotrimazole',\n",
       " 'Droperidol',\n",
       " 'Raltegravir',\n",
       " 'Nafcillin',\n",
       " 'Glycopyrrolate',\n",
       " 'Amantadine',\n",
       " 'Pyridoxine',\n",
       " 'Penciclovir',\n",
       " 'Norfloxacin',\n",
       " 'Spaglumic Acid',\n",
       " 'Caffeine',\n",
       " 'Methysergide',\n",
       " 'Phenytoin',\n",
       " 'Crotamiton',\n",
       " 'Lidocaine',\n",
       " 'Chlorthalidone',\n",
       " 'Methazolamide',\n",
       " 'Cortisone acetate',\n",
       " 'Lopinavir',\n",
       " 'Tetrabenazine',\n",
       " 'Milnacipran',\n",
       " 'Flupirtine',\n",
       " 'Levomilnacipran',\n",
       " 'Iloperidone',\n",
       " 'Propranolol',\n",
       " 'Montelukast',\n",
       " 'Eszopiclone',\n",
       " 'Zopiclone',\n",
       " 'Tetrahydrobiopterin',\n",
       " 'Latanoprost',\n",
       " 'Chloropyramine',\n",
       " 'Gliquidone',\n",
       " 'Pioglitazone',\n",
       " 'Dydrogesterone',\n",
       " 'Eprosartan',\n",
       " 'Rifaximin',\n",
       " 'Tolcapone',\n",
       " 'Iodipamide',\n",
       " 'Zolmitriptan',\n",
       " 'Viomycin',\n",
       " 'Mestranol',\n",
       " 'Carvedilol',\n",
       " 'Prochlorperazine',\n",
       " 'Bromhexine',\n",
       " 'Loratadine',\n",
       " 'Cisatracurium Besylate',\n",
       " 'Dyclonine',\n",
       " 'Atracurium',\n",
       " 'Halofantrine',\n",
       " 'Levocabastine',\n",
       " 'Clofazimine',\n",
       " 'Deferiprone',\n",
       " 'Tinidazole',\n",
       " 'Asenapine',\n",
       " 'Ifenprodil',\n",
       " 'Terconazole',\n",
       " 'Efavirenz',\n",
       " 'Sulfasalazine',\n",
       " 'Butenafine',\n",
       " 'Succimer',\n",
       " 'Valaciclovir',\n",
       " 'Amlexanox',\n",
       " 'Doxepin',\n",
       " 'Diloxanide',\n",
       " 'Brimonidine',\n",
       " 'Potassium Canrenoate',\n",
       " 'Niflumic Acid',\n",
       " 'Tolmetin',\n",
       " 'Rifabutin',\n",
       " 'Mefenamic acid',\n",
       " 'Bimatoprost',\n",
       " 'Nicotine',\n",
       " 'Acarbose',\n",
       " 'Galantamine',\n",
       " 'Felbamate',\n",
       " 'Mafenide',\n",
       " 'Mexiletine',\n",
       " 'Dexrazoxane',\n",
       " 'Pancuronium',\n",
       " 'Fluvoxamine',\n",
       " 'Primidone',\n",
       " 'Vecuronium',\n",
       " 'Ticarcillin',\n",
       " 'Mepyramine',\n",
       " 'Cycloserine',\n",
       " 'Lisuride',\n",
       " 'Acetylsalicylic acid',\n",
       " 'Naphazoline',\n",
       " 'Clodronate',\n",
       " 'Sulfamethoxazole',\n",
       " 'Imipramine',\n",
       " 'Methocarbamol',\n",
       " 'Carteolol',\n",
       " 'Chloroquine',\n",
       " 'Trazodone',\n",
       " 'Edrophonium',\n",
       " 'Cefdinir',\n",
       " 'Metyrapone',\n",
       " 'Dicoumarol',\n",
       " 'Guaifenesin',\n",
       " 'Propafenone',\n",
       " 'Oxymetazoline',\n",
       " 'Fexofenadine',\n",
       " 'Metronidazole',\n",
       " 'Midodrine',\n",
       " 'Zaleplon',\n",
       " 'Bambuterol',\n",
       " 'Diphemanil Methylsulfate',\n",
       " 'Benzatropine',\n",
       " 'Propofol',\n",
       " 'Lamotrigine',\n",
       " 'Aminoglutethimide',\n",
       " 'Bosentan',\n",
       " 'Norepinephrine',\n",
       " 'Scopolamine',\n",
       " 'Dolasetron',\n",
       " 'Bethanechol',\n",
       " 'Capecitabine',\n",
       " 'Rabeprazole',\n",
       " 'Prazosin',\n",
       " 'Phentolamine',\n",
       " 'Vigabatrin',\n",
       " 'Amisulpride',\n",
       " 'Pergolide',\n",
       " 'Voriconazole',\n",
       " 'Betazole',\n",
       " 'Articaine',\n",
       " 'Ethambutol',\n",
       " 'Cloxacillin',\n",
       " 'Brinzolamide',\n",
       " 'Clomipramine',\n",
       " 'Rifampicin',\n",
       " 'Mianserin',\n",
       " 'Griseofulvin',\n",
       " 'Dexbrompheniramine',\n",
       " 'Brompheniramine',\n",
       " 'Phylloquinone',\n",
       " 'Pantoprazole',\n",
       " 'Pheniramine',\n",
       " 'Doxazosin',\n",
       " 'Metolazone',\n",
       " 'Sertaconazole',\n",
       " 'Midazolam',\n",
       " 'Bicalutamide',\n",
       " 'Tolazoline',\n",
       " 'Lincomycin',\n",
       " 'Betaxolol',\n",
       " 'Oxacillin',\n",
       " 'Dobutamine',\n",
       " 'Fosinopril',\n",
       " 'Cefaclor',\n",
       " 'Flavoxate',\n",
       " 'Dopamine',\n",
       " 'Diethylstilbestrol',\n",
       " 'Bifonazole',\n",
       " 'L-Tryptophan',\n",
       " 'Pefloxacin',\n",
       " 'Haloperidol']"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "compound_names = [item['compound']['name'] for item in compounds]\n",
    "compound_names"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
